---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanTagComponentReference
source: html/56cacf45-aacf-b3e1-ab64-98b20e9ebb12.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanTagComponentReference Property

"Tag Component Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamSpanTagComponentReference { get; }
```